test/LES_smagorinsky_pimpleFoam_pipe/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

functions
{
wallShearStress1
    {
    // Mandatory entries (unmodifiable)
    type            wallShearStress;
    libs            (fieldFunctionObjects);

    // Optional entries (runtime modifiable)
    patches         (wall); // (wall1 "(wall2|wall3)");

    // Optional (inherited) entries
    writePrecision  8;
    writeToFile     true;
    useUserTime     true;
    // region          region0;
    enabled         true;
    log             true;
    // timeStart       0;
    // timeEnd         1000;
    executeControl  writeTime;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   1;
    }

averageWallShearStress
{
    // Mandatory entries (unmodifiable)
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    fields          (wallShearStress);
    operation       areaAverage;
    regionType      patch;
    name            wall;

    // Optional entries (runtime modifiable)
    // postOperation   none;
    // weightField     alpha1;
    // scaleFactor     1.0;
    // writeArea       false;
    surfaceFormat   none;

    // Optional (inherited) entries
    writeFields     true;
    // scalingFactor   1.0;
    // writePrecision  8;
    // writeToFile     true;
    // useUserTime     true;
    // region          region0;
    // enabled         true;
    // log             true;
    // timeStart       0;
    // timeEnd         1000;
    // executeControl  timeStep;
    // executeInterval 1;
    // writeControl    timeStep;
    // writeInterval   1;
}


}

// ************************************************************************* //
